app/views/dogs/_thumbnail.html.erb

    <h2 class="dog-name"><%= dog.name %></h2>
    <%= image_tag url_for(dog.images.first), class: "dog-photo", alt: "Photo of #{dog.name}" %>
---
SELECT  "dogs".* FROM "dogs" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]