app/controllers/dogs_controller.rb

SELECT  "dogs".* FROM "dogs" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
---
  def index
    # BACKEND TECH ASSESSMENT CHALLENGE 1: Using will_paginate gem (added go gemfile) to add pagination to display 5 dogs per page
    @dogs = Dog.paginate(:page=>params[:page],per_page:5)